{"Changes":[
    {
        "LogName": "Penny",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Penny",
        "Entries": {
            "winter_24{{YearRemainder}}": "I wonder if my mom's going to get me something for Winter Star this year, or she'll forget again...$s",
        }
    },
    {
        "LogName": "Penny - Y1",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Penny",
        "When": {"YearModulus": "1"},
        "Entries": {
            "11{{YearRemainder}}": "Mom used to bring me books she came across in gas stations.#$b#Generally simple, cheap romances, but I loved them all the same."
        }
    },
    {
        "LogName": "Penny - Y2",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Penny",
        "When": {"YearModulus": "2"},
        "Entries": {
            "Mon8": "Some days I still can't believe I'm no longer living in a trailer.$h",

            "3_2": "You'd think we wouldn't have so many dishes to do, considering the fact that Mom mostly lives off of TV dinners...",
            "7_2": "Gotta swing by the post office to pick up our mail today.#$b#What am I waiting for? Just a copy of the latest Homes and Gardens magazine.#$e#I'd love, love to decorate more, but I haven't the time. It's hard enough just keeping our home clean.",
            "11_2": "@, are you planning on seeing the new movie with %name Taylor?",
            "13_2": "If you weren't a farmer, @, what would you want to be?#$b#Me? I'm not sure. I think...I think I mostly want to be a mother.#$e#When I was a kid I wanted to be an archaeologist though.",
            "14_2": "Mom says I spend too much time taking care of her.#$b#I'm not sure how not to, though.$s",
            "16_2": "Mom brought me a book today. Said she picked it up at a gas station while she was out driving that bus.$h",
            "17_2": "We really should cook more, that'd be so much better for our budget over buying TV dinners.$s",
            "18_2": "$d joja#All the unhealthy food is so much cheaper at Joja over the fresh fruits and veggies.$s|Now that's Joja's closed, Mom's been shopping more at Pierre's. It's...good for the town, maybe, but not our budget.",
            "19_2": "Books have always been my escape from reality, @.#$e#No matter what was going on in my life, I could always disappear into a good book."
        }
    },
    {
        "LogName": "Penny - Y3",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Penny",
        "When": {"YearModulus": "3"},
        "Entries": {
            "summer_Tue8": "$d Joja#Gosh, it must be so hard for small businessowners like Pierre these days, with Joja expanding everywhere and vacuuming up the whole market.|I'm not sure Joja was ever cheaper than Pierre's when it came to nonprocessed food. Sure, calorie by calorie it's cheaper, but were those good calories?",

            "3_2": "When we lived in the trailer, Mrs. Mullner would let me do laundry in her washer.#$b#She's always been so nice to my mother and I.$h",
            "4_2": "I made some extra poppyseed muffins, @, do you want one?$h[651]",
            "6_2": "I have so much mopping I need to do.$s"
        }
    },
    {
        "LogName": "Penny - Y4",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Penny",
        "When": {"YearModulus": "4"},
        "Entries": {
            "3_2": "Ugh, I hope either Mom or I get a raise soon, this inflation is brutal.$s",
            "13_2": "I was trying to cook {{Dish}} again recently, but it's much harder than I thought it would be."
        }
    }
]}