// Primary major is accounting/business, would rather study history.
// Or maybe become an adventurer. She's not sure herself.

{"Changes":[
    {
        "LogName": "Abigail mid-hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Abigail",
        "Entries": {
            // conversation topics
            "movieTheater": "Oh, a movie theater! @, would you like to go sometime?$h",

            // day-specific
            "spring_12{{YearRemainder}}": "You ready for the egg hunt tomorrow, @? I'm gonna smoke you!$h",
            "spring_23{{YearRemainder}}": "I really don't want to dance at the flower dance tomorrow.$a",
            "summer_27{{YearRemainder}}": "Ugh, I'm not ready for summer to end.$s",

            // general
            "7{{YearRemainder}}": "I hate group projects.$s#$b#Trying to get my teammates to do their work when we're all remote is stupid hard.$a",
            "10{{YearRemainder}}": "Sam and I are thinking about going down to %place to catch a concert. You in?$h",
            "15{{YearRemainder}}": "%Abigail looks exhausted#$b#Heyyya, @, I was up all night cramming for a test. Again. Think I passed, though!",
            "26{{YearRemainder}}": "I'm the only one in my family who loves spicy eel.%revealtasteAbigail226#$b#Wish I was better at cooking, so I could make it more often...",

            // Ginger Island
            "Resort_Shore_3": "I think I'm starting to sunburn.$s",
            "Resort_Bar_2": "Heya @, what drink're you looking forward to?"
        }
    },
    {
        "LogName": "Abigail mid-hearts - Joja",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Abigail",
        "When": {"IsJojaMartComplete": true},
        "Entries": {
            "fall_Wed6": "Feels like ever since Joja took over, Dad's done nothing but work.#$e#I'm afraid he'll have a heart attack if he keeps working like this.$s"
        }
    },
    {
        "LogName": "Abigail mid-heart, Y2",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Abigail",
        "Entries": {
            "Fri4": "Spending another Friday evening at the Saloon. Guess there's not much else to do in a small town.$s",

            "Sun8": "Between you and I, @, I'm not sure I'm cut out for college.#$b#Dad says that if I drop out, I'll have to start paying rent, though.",
            "Mon8": "I'd love to see more movies, but Dad doesn't give me an allowance big enough to see movies often.#$b#Also, I'm saving up for a new video game.#$e#Maybe I should ask for a small salary, for the work I do for him around the shop.$s",

            // before egg hunt
            "spring_12{{YearRemainder}}": "This year I'll beat you at the egg hunt I swear.",

            "1_2": "Ugh, Mayor Lewis wants to put together a square dance club. @, do I look like someone who would square dance?$s",
            "2_2": "I wish I could convince my father that adventuring is a perfectly reasonable career. Look at Marlon, he does it!",
            "6_2": "I've got so much homework I need to do.$s",
            "7_2": "Mom wants me to dust the whole house today.$a",
            "8_2": "Linear algebra is kicking my ass.#$b#Say, @, you any good at math?",
            "12_2": "Ugh, I hate doing the dishes.$s#$b#Of all my chores, that's probably the one I hate the most.",
            "14_2": "Hiya, @, I don't have time to chat today, I've got a midterm to study for.",
            "16_2": "Ugh. @, just between you and me, I'm really not feeling my major.",
            "18_2": "%Abigail appears to be exhausted.#$b#Sorry, @, I was up alllllll night playing {{i18n:video.game.{{Random:01, 02, 03, 04, 05, 06, 07, 08, 09}} }}. How have you been?",
            "19_2": "Have any new games worth playing come out recently?",
            "22_2": "Dad gives me an allowance, but it isn't very much.$s",
            "24_2": "I wonder if I'll ever be as good at art as Leah is...#$b#Probably not. She draws all the time, I don't have the time for that.",
            "25_2": "@, I don't know what I want to do with my life.#$b#I don't want to become the owner of a grocery store, but I'm not sure what else I can do.$s",
            "26_2": "There's a music festival next month. I'd love to go, but I haven't the money.$s",
            "28_2": "Ugh, I've got an essay due tomorrow but I haven't started yet.$s"
        },
        "When": {
            "YearModulus": "2"
        }
    },
    {
        "LogName": "Abigail mid-hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Abigail",
        "Entries": {
            "summer_Sun6": "#$c .5#Haley showed me her new sunscreen. It feels so much lighter on my skin!#Do you wear sunscreen, @? You probably do, you're under the sun farming all day.",

            // before egg hunt
            "spring_12{{YearRemainder}}": "Mom thinks I'm getting too old for the egg hunt, but I'm still having fun.$h",

            "fall_Tue6": "Fall's my favorite season. I love how the trees look with their new colors.$h",

            "5_2": "Ugh, I still have a foreign language requirement to get through. @, what language do you think I should pick?",
            "6_2": "Between you and I, @, I wish dad would let me change my major.#$b#I'm really not cut out for business administration.",
            "10_2": "Dad wants me to restock shelves for him.#$b#No, he doesn't pay me...$s",
            "12_2": "Ugh, everything hurts. I had to spend hours yesterday helping Dad with the stockroom.$a",
            "16_2": "Mom and I spent forever trying to balance the books yesterday.$a",
            "18_2": "Dad thinks I should get out of this town. He says there's more 'opportunity' away from here.#$b#I'm not sure, though, @.",
            "19_2": "Say, @, did you ever go to college?",
            "25_2": "Dad won't say it, but I know money is a lot tighter than what he'd like.$s",
            "28_2": "I wish dad would let me become an adventurer. That seems more fun.$s#$b#Adventuring is a valid career path! Marlon manages!"
        },
        "When": {
            "YearModulus": "3"
        }
    },
    {
        "LogName": "Abigail mid-hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Abigail",
        "Entries": {
            "winter_Wed10": "Ugh, nothing ever interesting happens in this town, I'm so bored.",

            // before egg hunt
            "spring_12{{YearRemainder}}": "$y 'Think I should let the kids win the egg hunt this year?_Yes_Hmmph, I guess....I'll consider it._No_You're right, @, they'll know if I pander to them.'",

            "fall_Tue6": "I've got my language class today, @.#$b#Why does my degree program have a language requirement anyways?#$e#Say, @, how many languages do you know?",

            "6_2": "Oh, looks like %name Taylor is performing in Grampleton next Friday. Should I get tickets?",
            "7_2": "Math has never been my strong suit, unfortunately.#$b#Wish pops wasn't pushing me so hard to get a business degree.$s",
            "12_2": "All our town events are so boring. I wish we had more interesting things to do...",
            "15_2": "I have so many assignments I have to finish before tomorrow.$s"
        },
        "When": {
            "YearModulus": "4"
        }
    },
    {
        "LogName": "Abigail mid-hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Abigail",
        "Entries": {
            // before egg hunt
            "spring_12{{YearRemainder}}": "I've been training so hard for this hunt, I'll definitely beat you this year!$h",

            "4_2": "Dad had me mopping the store for hours.#$b#It's pretty big, especially when you consider the aerobics area and the church.$s"
        },
        "When": {
            "YearModulus": "0"
        }
    },
    {
        "LogName": "Rain -- during winter.",
        "Action": "EditData",
        "Target": "Characters/Dialogue/rainy",
        "When": {"Season": "winter"},
        "Entries":{
            "Abigail": "#$c .5#Sleet is no fun to be out in.#I wonder if it's warmer in the caves right now?"
        }
    }
]}