{"Changes":[

    // High school jock exterior hides a more responsible interior.
    // still trying to defend his mother.

    // grew up in Pelican Town.

    // Personally I doubt he can become pro if he hasn't been scouted yet, so
    // we're going to divert him to being a physical trainer.

    // Maybe slowly ease him into bouldering?

    // slowly, slowly, but he will learn. I almost think he might be dyslexic? And might benefit from alternative learning programs?

    // really should take an interest in your pet.
    {
        "LogName": "Rain -- during winter.",
        "Action": "EditData",
        "Target": "Characters/Dialogue/rainy",
        "When": {"Season": "winter"},
        "Entries":{
            "Alex": "#$c .5#Hmmph. This is not good weather for sports, but... oh well, I can always lift weights inside.#Days like this let the truly dedicated show their mettle.#$b#What? I know some words."
        }
    },
    {
        "LogName": "Alex - strings",
        "Action": "EditData",
        "Target": "Strings/schedules/Alex",
        "Entries": {
            "summer_16.000": "Gosh, @, I think I might have shin splits.$s",
            "summer_16.001": "Alright, doc, how bad is it?"
        }
    },
    {
        "LogName": "Alex - mid hearts - Y1",
        "Action": "EditData",
        "Target" :"Characters/Dialogue/Alex",
        "When": {"YearModulus": "1"},
        "Entries": {
            // specific days
            "summer_10{{YearRemainder}}": "Hey, @, will you be a the luau tomorrow?$h",

            // intentional Y1 only.
            "1": "I'm gonna be famous one day, @, just you wait.",
            "2": "One day, I'm gonna go pro and be all over TV.#$e#And I'll have all the branded footwear I could ever want.$h",

            "1_2": "When I was young, we had a little corner shop that sold the best burgers and fries.#$e#Sadly, it closed down years ago.",
            "2_2": "Ugh, I think I'm out of protein powder. Gotta order more online.",
            "3{{YearRemainder}}": "Selling ice cream at the little stand? That was my summer job ever since high school. Makes me a little money.",
            "5{{YearRemainder}}": "Boy am I glad to not be in high school anymore. I had to wake up at like three in the morning to make practice at five.",
            "6{{YearRemainder}}": "I train six days a week, every week.$h",
            "7{{YearRemainder}}": "Got any farm-fresh eggs, @? Nothing like a nice egg in the morning.$h",
            "8{{YearRemainder}}": "Pops used to take me fishing, back when...#$b#No, no reason to dwell on that.",
            "9{{YearRemainder}}": "Gotta work on my squat form today.#$b#And no, it's not an excuse to look at myself in the mirror.$h",
            "10{{YearRemainder}}": "Sometimes it feels like everyone is just tryin' to sell you some supplement or another.$s",

            "summer_Sun8": "Hey, @, you wanna play some frisbee?"
        }
    },
    {
        "LogName": "Alex - mid hearts - Y1 - with pet",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Alex",
        "When": {
            "YearModulus": "1",
            "HasPet": true
        },
        "Entries": {
            "10{{YearRemainder}}": "Hey, how is %pet doing?",
        }
    },
    {
        "LogName": "Alex - mid hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Alex",
        "When": {"YearModulus": "2"},
        "Entries": {
            "Resort_Towel_2": "Come join me, @, I'm working on my tan!",

            "winter_Mon4": "Maybe I should take up hockey?#$e#@, you think I'd be good at hockey?#$e#What am I'm saying, I'm good at everything.",
            "winter_Wed8": "Probably gonna go lift weights.#$e#Working out outside is so much more fun, though.",
            "winter_Sat8": "Hey @, what's your favorite hockey club?#$e#I've been thinking of going to a game sometime, you in?",
            "winter_Sun8": "After a nice session lifting weights, I love taking a dip in the spa.$h",

            "Fri8": "You know what, @? While I'd love to go pro some day, I'm not sure I should leave my Grandma and Grandpa alone right now.",
            "4_2": "@! I saw a new exercise on social media the other day. Can't wait to try it out.#$e#Basically, you kneel on the ground, and get someone to hold your feet still...#$b#Then you lean forward until your nose is on the floor. It's surprisingly hard!",
            "6_2": "There's nothing like a nice early morning run.$h",
            "7_2": "If I don't work out, I don't feel right.$s",
            "8_2": "Sam showed me a video on bouldering. I'm amazed at what these athletes can do!",
            "10_2": "Nothing like some nice fresh salmon for dinner!$h%revealtasteAlex212#$b#$c .9#My granny's a great cook, and I'm definitely learning a lot from her.#Here, I've got some extra![212]#",
            "11_2": "Sam and I went running this morning. Company's always nice on a long run.#$b#Hey, @, would you ever be interested?",
            "13_2": "Grandma thinks I might make a good physical trainer some day.",
            "14_2": "It's important to adapt exercises to what you can do.#$b#Trying to do something too hard will just get you injured.#$e#In middle school I broke my ankle and had to sit out for weeks because I tried to copy a skateboard trick from Sam.",
            "15_2": "Haley and I are thinking of going down to %place to catch a %name Taylor concert. You in?$h",
            "17_2": "I love nothing more than running along the beach.$h",
            "18_2": "Have you ever used a foam roller, @? Helps loosen those muscles right up.$h",
            "19_2": "Wasn't paying attention the other day, tripped over a tree root.$s#$e#Hopefully I didn't twist my ankle.$s",
            "20_2": "I've got so much I need to learn about nutrition...say, @, you think I could get Maru to tutor me sometime?",
            "21_2": "Looking good, @! Did you change anything in your routine?",
            "22_2": "Think I should pick up a new pair of shoes, this pair might be getting a bit dated."
        }
    },
    {
        "LogName": "Alex - mid hearts - Y2 - marriage",
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueAlex",
        "When": {"YearModulus": "2"},
        "Entries": {
            "Indoor_Day_3": "#$c .5#Heya, @, I made you some salmon! Just like my grannie's old recipe[212]$h.#Made you some fish for today! You're gonna need the protein! [212 213 214]",

            "Good_0": "@, I love you so so much!",
            "Good_1": "Looking good today, @. You do anything different with your hair?",

            "summer_Alex": "#$c .5#Mmmm. Such a nice day, maybe I should go swimming?#Summer's my favorite season, I've always have the most energy.$h",

            "JoshHouse_Entry": "Granny, I'm home!"
        }
    },
    {
        "LogName" :"Alex - mid hearts - Y3",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Alex",
        "When": {"YearModulus": "3"},
        "Entries": {
            "3_2": "Emily gave me a recipe for a chia seed smoothie the other day! Plenty of protein in it, and it tastes great!$h",
            "5_2": "You know, @, if my sports career never happens, maybe I should go into politics?#$b#I do have a 'winning smile'.$h",
            "6_2": "We used to have to bus for more than an hour to get to the nearest high school.#$e#Won't be so bad for Jas and Vincent, though, there's a newer high school closer to us now.",
            "7_2": "I've been trying to work towards a dragon squat lately, but man do you need flexibility for that.$s"
        }
    },
    {
        "LogName": "Alex - mid hearts - Y4",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Alex",
        "When": {"YearModulus": "4"},
        "Entries": {
            "Fri10": "I've gotta stay strong for Grandma and Grandpa. I'm all they've got, now.",
            "summer_Sun4": "It's an election year, @!#$b#Do I think the Governor is going to get re-elected? Of course I do, he always gets re-elected.",
            "summer_Wed8": "Might go take a swim in the ocean today. @, you in?$h",

            // specific days
            "summer_27_2": "Gosh, @, summer's almost over, isn't it? The Moonlight Jellies are gonna be here tomorrow.",

            "2_2": "My grandparents are the most important people in the world to me.$h",
            "3_2": "When I was young, I'd bike around and deliver the newspaper. But most people don't want paper newspapers anymore.#$b#It's all TV and online news now. Even Gramps doesn't read the paper anymore.#$e#Man I'm starting to sound like him, am I?",
            "4_2": "@, what sport did you play in high school?",
            "6_2": "Lewis has been mayor for as long as I can remember. That's some job security, eh?#$b#Have I considered running? Sure. But it sounds boring.",
            "7_2": "If Lewis wasn't mayor anymore...I don't know, I'd probably vote for Gus. Everyone loves Gus."
        }
    },
    {
        "Action": "EditData",
        "LogName":"Alex - mid hearts - Y5",
        "Target": "Characters/Dialogue/Alex",
        "Entries": {
            "1_2": "Ah, start of the new month, what new exercises should I do?$h",
            "3_2": "@, I did five hundred squats yesterday. Five hundred!#$b#Assuming I didn't miscount.",
            "4_2": "@, I'm thinking of going ice skating some day. You got time for that?#$b#We'll have to go down into the city for that, though."
        },
        "When": {"YearModulus": 0}
    }
]}