{"Changes":[
    // Sebastian is a contractor mostly working on javascript mobile games. He lacks a college degree and 
    // feels that people don't respect him because of that. He also finds it harder to find employment (probably true)

    
    {
        "LogName": "Sebastian mid-hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Sebastian",
        "Entries": {
            "6_2": "Why is it every time I have to work with a Java team, they've done something weird with their architecture?$a",
            "8_2": "Hey @, have you ever played {{i18n:video.game.{{Random:01, 02, 03, 04, 05, 06, 07, 08, 09}} }}? It's so good, isn't it?",

            "SebastianRoom_9_4": "%Sebastian seems to be on a call.#$b#Jane, I needed this reviewed last week! Could you please help me convince everyone to help keep things moving?",
            "summerSebastianRoom_9_4": "Sorry, @, I'm working and need to focus right now.",
            "fallSebastianRoom_9_4": "Work? Nah, @, I can implement A-star in my sleep.",
            "winterSebastianRoom_9_4": "Sorry, @, I need to work on my performance report. Why do they make me do this every year?$s"
        },
        "When": {
            "YearModulus": "2"
        }
    },
    {
        "LogName": "Sebastian mid-hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Sebastian",
        "Entries": {
            "winter_15_2": "@, I got a five percent raise this year! Biggest one they've ever given me!$h",

            "3_2": "Did you hear of the story of the printer that wouldn't print on Tuesdays?#$b#Man, there's always interesting bugs in the world.",

            "SebastianRoom_9_4": "%Sebastian seems to be on a call.#$b#I saw your email; is there anything in particular we could change?",
            "summerSebastianRoom_9_4": "#$c .5#I have so much work I need to do, @. Sorry, but I don't have time to chat today.#What, @, I have a performance review coming up, I need to focus$a.#",
            "fallSebastianRoom_9_4": "Ugh, I have so many emails I need to reply to.$s",
            "winterSebastianRoom_9_4": "%Sebastian looks a little bleary-eyed.#$b#Sorry, @, I was up all night debugging.$s"
        },
        "When": {
            "YearModulus": "3"
        }
    },
    {
        "LogName": "Sebastian mid-hearts",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Sebastian",
        "Entries": {
            "8_2": "Did you see the story about the guy who couldn't send an email with a distance greater than 500 mi? That one was amusing.$h",
            "10_2": "All my coworkers are like, have you heard of this new programming language? It has so much more static analysis, apparently.#$b#Frankly, I'm tired of hearing about it.",

            "SebastianRoom_9_4": "%Sebastian seems to be on a call.#$b#I'm not sure I understand the third requirement.#$b#Exactly what hardware are we expected to support here?",
            "summerSebastianRoom_9_4": "@, sorry, I don't have time to speak today. I've got a very hairy bug to track down.",
            "fallSebastianRoom_9_4": "Ugh, we're updating dependencies today, so nothing works and I haven't the clue why."
        },
        "When": {
            "YearModulus": "4"
        }
    },
    {
        "LogName": "Rain -- during winter.",
        "Action": "EditData",
        "Target": "Characters/Dialogue/rainy",
        "When": {"Season": "winter"},
        "Entries":{
            "Sebastian": "Ocean gazing? In this weather?"
        }
    }
]}