{
    // Config
    "config.DemetriusVisitDay.name": "Demetrius Visit Day",
    "config.DemetriusVisitDay.description": "Select which day Demetrius visits the farm cave. If you select a specific day, he will visit once per month. If you select a day of the week, he'll visit once per week.",

    "config.OnlyIfRainingOrWinter.name": "Raining Or Winter Only",
    "config.OnlyIfRainingOrWinter.description": "Whether or not Demetrius should only visit on raining days or during winter (when he would otherwise stay indoors only.)",

    "config.OverrideUnlock.name": "Override Unlock",
    "config.OverrideUnlock.description": "If enabled, Demetrius will show up regardless of whether or not he's set up the farm cave.",

    "config.EnableDialogue.name": "Enable Dialogue",
    "config.EnableDialogue.description": "Whether or not the dialogue from this mod should be enabled",

    "config.section.Position.name": "Position",
    "config.section.Position.description": "Controls the tiles Demetrius stands on and leaves the farmcave from.",

    "config.XPosition.name": "X Position",
    "config.XPosition.description": "Demetrius's x position. You probably don't need to change this.",

    "config.YPosition.name": "Y Position",
    "config.YPosition.description": "Demetrius's y position. You probably don't need to change this.",

    "config.XWarp.name": "Warp X",
    "config.XWarp.description": "The X location of the tile Demetrius leaves the farm cave from. You probably don't need to change this",

    "config.YWarp.name": "Warp Y",
    "config.YWarp.description": "The y location of the tile Demetrius leaves the farm cave from. You probably don't need to change this",

    // bats
    "demetrius.Bats.Spring.00": "Isn't it amazing, @, how bats can fly? They're the only group of mammals that can, and that's likely what helps them be so diverse.",
    "demetrius.Bats.Spring.01": "We actually don't have many bat specimens in the fossil record, as they are generally small and their bones are light.#$b#Of the specimens we do have, for most we have only their jaw.",
    "demetrius.Bats.Spring.02": "Bats, like birds, live much much longer than you'd expect, given their size. They can live up to thirty years!",
    "demetrius.Bats.Spring.03": "Bat guano makes for excellent fertilizer. Before the invention of chemical fertilizers, countries would literally export bat poop!",
    "demetrius.Bats.Spring.04": "Ugh, I have so many grants I need to write...",
    "demetrius.Bats.Spring.05": "So much work to do...$s",
    "demetrius.Bats.Spring.06": "The majority of bats eat insects. They help reduce the need for pesticides.",
    "demetrius.Bats.Spring.07": "Vertebrates only have evolved flight three times - once for birds, once for bats, and once for pterodactyls.",
    "demetrius.Bats.Spring.08": "When I was a kid, I'd go out hiking in our local woods and pick up sharks teeth.#$b#Such a reminder of how much our little planet changes over time, the place I grew up was a shallow sea millions of years ago.",
    "demetrius.Bats.Spring.09": "Between you and I, @, I wish I didn't have to prompt my collaborator so often about getting his edits in.",
    "demetrius.Bats.Spring.10": "%Demetrius looks exhausted.#$b#Sorry, @, I was up half the night yesterday trying to get Figure 2 to stay on page 2.$s",

    "demetrius.Bats.Summer.00": "I'm glad you've decided to host some bats here, @. Loss of habitat is one of the main things threatening bats these days.#$b#It's only a small thing but small things add up.",
    "demetrius.Bats.Summer.01": "Fruit bats are major pollinators, too! Among other things, they'll pollinate mango and banana trees.",
    "demetrius.Bats.Summer.02": "Because bats use echolocation to navigate, bat-pollinated flowers are usually pale. They sometimes have acoustic features, too, to make them more obvious.",
    "demetrius.Bats.Summer.03": "To get through cold winters, most bats hibernate, although some migrate.",
    "demetrius.Bats.Summer.04": "The wings of bats are homologous to our hands. In fact, that their scientific name - chiroptera - translates to 'hand wing'.",
    "demetrius.Bats.Summer.05": "Bats have special adaptations that let them roost upside down without all their blood flowing to their head.$h",
    "demetrius.Bats.Summer.06": "Compared to birds, bats have much more flexible wings. That's because their wings are homologous to our hands, not our arms.",
    "demetrius.Bats.Summer.07": "We got our paper accepted for publication!$h",
    "demetrius.Bats.Summer.08": "Did you know bats can reach up to 100 miles per hour?$h",
    "demetrius.Bats.Summer.09": "Part of the difficulty of studying bats is that they appear, basically fully formed, in the fossil record.#$b#We don't have good examples of transitional forms.",
    "demetrius.Bats.Summer.10": "Got rejected for another grant. It's hard getting scientific funding these days.$s",

    "demetrius.Bats.Fall.00": "Because bats reproduce slowly, they are extremely sensitive to habitat destruction.$s",
    "demetrius.Bats.Fall.01": "And that's all the data I need for Figure 2...hopefully!$h",
    "demetrius.Bats.Fall.02": "Many bats live in the tropics only, where they are very susceptible to habitat destruction.",
    "demetrius.Bats.Fall.03": "Painted bats are known for their bright coloration, unlike most bats, which tend towards drab colors.#$b#Scientists think that being bright orange may make them appear to be flowers or fruit when they roost",
    "demetrius.Bats.Fall.04": "Because they tend to be nocturnal, bats use echolocation to navigate! Some bats can even change their calls to account for Doppler shift!#$b#Of course, they have perfectly serviceable vision as well, the idiom 'blind as a bat' doesn't really fit.#$b#In fact, bats that don't echolocate have vision far exceeding ours.",
    "demetrius.Bats.Fall.05": "Getting population estimates for the bats...#$b#Well, @, I just stand here and count them. It's very tedious work.$s#$b#I'm just joking with you, we actually use thermal imagers.",
    "demetrius.Bats.Fall.06": "Most bats eat insects, and some eat primarily fruit or nectar. Only three species survive by drinking blood.#$b#The vampire bats even share blood if any of them didn't manage to feed that day.",
    "demetrius.Bats.Fall.07": "I'd love to be able to fly like a bat one day. Doesn't that look so fun, @?",
    "demetrius.Bats.Fall.08": "Many bats live only in forests, roosting in the holes produced by woodpeckers.#$b#Unfortunately, logging threatens the habitats of these poor bats.$s",
    "demetrius.Bats.Fall.09": "Pesticides are a double threat to bats. Not only do they kill the insects that bats feed on, they may accumulate in the bats themselves and poison them over time.$s",
    "demetrius.Bats.Fall.10": "Even all these years later I still get nightmares about accidentally forgetting to go to a final exam.$s#$b#I've been out of school for how long and I still get them.$s",

    "demetrius.Bats.Winter.00": "Thanks, @, for letting me keep tabs on this little bat population here.#$b#It's certainly been very helpful for my research!$$h",
    "demetrius.Bats.Winter.01": "Many bats hibernate through the winters, when food supplies are low.#$b#Powered flight takes a lot of energy, of course.",
    "demetrius.Bats.Winter.02": "I've always wondered, for migratory bats, how do they navigate?#$b#Current science seems to point at the earth's magnetic field, and also the location of sunrise and sunset.",
    "demetrius.Bats.Winter.03": "Bats usually have their pups in spring. So these here, they'll be having pups soon!",
    "demetrius.Bats.Winter.04": "Apparently, bats can eavesdrop on other bats.#$b#One of the ways migratory bats find good homes at the end of their migrations is by eavesdropping on the locals.",
    "demetrius.Bats.Winter.05": "Some bats, the ones that tend to drink nectar, can even see ultraviolet light! Others have perfectly serviceable cone cells.#$b#The idiom 'blind as a bat' really doesn't make much sense, doesn't it?",
    "demetrius.Bats.Winter.06": "Not every bat echolocates. Most of the larger ones done, for example. We think that might be because their echolocation is tied heavily to the rate they flap their wings, so it's less efficient for big bats.",
    "demetrius.Bats.Winter.07": "Have you ever considered, @, how demanding flight really is, physiologically?#$b#A bat's heart can beat over a thousand times per minute in flight, but it slows to twelve beats per minute when they're hibernating.#$b#In contrast, yours and mine go between about seventy to about two hundred beats per minute.",
    "demetrius.Bats.Winter.08": "I've been attaching little radio transmitters to these bats, so we can track their movements.$h#$b#These little transmitters have certainly gotten so much smaller over the last few years, letting us use them with the bats.$h",
    "demetrius.Bats.Winter.09": "Did you know, @, some bats migrate hundreds or even thousands of miles in winter? We're not quite sure what causes a bat to decide to migrate and how they choose their destination.",
    "demetrius.Bats.Winter.10": "I've got my end-of-year report coming up, which means now I need to remember what I did all year.#$b#@, I can barely remember what I ate for lunch yesterday, never mind what I did this year...$s",

    // mushies!
    "demetrius.Mushrooms.Spring.00": "Some fungi, when they infect ants, can reprogram the ants to climb and hang upside down from a leaf. This helps them disperse their spores.",
    "demetrius.Mushrooms.Spring.01": "I've got a paper submission I really need to gather more data for, *sigh*.",
    "demetrius.Mushrooms.Spring.02": "Mushrooms form a close symbiotic relationship with plants. They help trees share nutrients in times of stress.",
    "demetrius.Mushrooms.Spring.03": "Without mushrooms and other decomposers, organic material would build up and the carbon cycle would slow down drastically.#$b#That actually happened once, you know, when lignin first evolved and nothing could break it down.",
    "demetrius.Mushrooms.Spring.04": "It's amazing, how many different species of mushroom live in here...",
    "demetrius.Mushrooms.Spring.05": "Mushrooms are actually far more closely related to us than they are to plants!",
    "demetrius.Mushrooms.Spring.06": "If you go out foraging, you can often find edible mushrooms. Just be careful in your identification.",
    "demetrius.Mushrooms.Spring.07": "Some species of ants actually farm fungi. Leafcutter ants, for example, bring back cuttings of leaves to feed a fungus they grow in their nests.",
    "demetrius.Mushrooms.Spring.08": "Mushrooms are some of the oldest and largest organisms on this plant.#$b#But since all we see is the fruiting caps, it's sometime hard to notice.",
    "demetrius.Mushrooms.Spring.09": "Grants, grants, grants, always more grants to write...",
    "demetrius.Mushrooms.Spring.10": "You know, @, it's nice to have my lab space in my home. Back when I lived in Zuzu City, my commute was horrid.$h",

    "demetrius.Mushrooms.Summer.00": "Single-celled fungi are called yeast, and are a major part of cooking, helping us make both bread and beer.$h#$b#And both of those are quite nice.",
    "demetrius.Mushrooms.Summer.01": "Apart from what they do for us ecologically, mushrooms are quite tasty.#$b#Dried mushrooms really are nature's stock cube, and they'll add a nice depth of flavor to many stocks and soups.",
    "demetrius.Mushrooms.Summer.02": "There's apparently a species of mushroom that tastes quite a bit like chicken, although I've never had the opportunity to try it myself.",
    "demetrius.Mushrooms.Summer.03": "Mushrooms use chitin as their structural protein. It's the same protein that forms the exoskeletons of insects.",
    "demetrius.Mushrooms.Summer.04": "A few species of mushrooms even glow in the dark!",
    "demetrius.Mushrooms.Summer.05": "Trees often use the symbiotic network they form with mushrooms to communicate with other trees.",
    "demetrius.Mushrooms.Summer.06": "Lichens are a symbiosis between a fungi and either an algae or a photosynthetic bacteria. They're some of the hardiest creatures on our planet and can grow nearly everywhere.",
    "demetrius.Mushrooms.Summer.07": "Mushrooms are actually the fruiting bodies of fungi. But fungi can also reproduce asexually.",
    "demetrius.Mushrooms.Summer.08": "We often get antibiotics from fungi. Penicillin, for example, was originally extracted from Penicillium molds.",
    "demetrius.Mushrooms.Summer.09": "I got a poster in my field's premier conference!$h#$b#But that means I need to make a poster.$s",
    "demetrius.Mushrooms.Summer.10": "Just got a grant for new equipment, @, I'm so excited.$h",

    "demetrius.Mushrooms.Fall.00": "Humans have apparently been using yeast to brew mead for more than 9000 years. What a long tradition, eh?#$b#Say, @, have you dropped by the Saloon lately? Is Gus carrying anything new?",
    "demetrius.Mushrooms.Fall.01": "Yeasts, which are single-celled fungi, are often used as model eukaryotic organisms.#$b#They're also used to make bread, of course.$h",
    "demetrius.Mushrooms.Fall.02": "You know, @, Figure 2 is going to be amazing.#$b#I've put so much work into this paper, it better get accepted...",
    "demetrius.Mushrooms.Fall.03": "There are even some fungi that grow in the digestive tracts of ruminants like cows and sheep, where they help break down fiber!$h#$b#Fungi are really everywhere, aren't they? Well, I guess we should be glad fun-guys are everywhere!$h#$b#...Get it?$h",
    "demetrius.Mushrooms.Fall.04": "While we typically associate fall with mushrooms, they can actually be foraged in most every season.",
    "demetrius.Mushrooms.Fall.05": "Saw a paper recently where they were using fungi to break down plastics.#$b#Isn't it amazing, what nature can do?",
    "demetrius.Mushrooms.Fall.06": "And yet another paper rejected. I have in mind a few other journals I can send it to, but it's hard to not take every rejection personally.$s",
    "demetrius.Mushrooms.Fall.07": "Some fungi can sequester heavy metals and radioactive elements, which makes then ideal for remediation.",
    "demetrius.Mushrooms.Fall.08": "Despite superficial similarities, slime molds aren't considered fungi.#$b#You can think of slime molds as single-celled organisms that gather into a mass during difficult times.",
    "demetrius.Mushrooms.Fall.09": "Unlike most of our cells, the cells of fungi can have multiple nuclei.#$b#No, I'm not sure what evolutionary benefit that has. Some people say it helps cells produce more proteins.",
    "demetrius.Mushrooms.Fall.10": "Did you see that new paper out of Grampleton University? With all that sequencing data?#$b#It's amazing just how quickly sequencing is getting cheaper these days.",

    "demetrius.Mushrooms.Winter.00": "Just collecting some data for my supplementary info section now. Gotta shore everything up, keep reviewer 2 happy.",
    "demetrius.Mushrooms.Winter.01": "Mushrooms are nutritionally quite good for you, @!$h#$b#Except for the ones that are poisonous, of course.",
    "demetrius.Mushrooms.Winter.02": "When fungi partner with plants, that's called mycorrhiza. Some of these mycorrhiza even excrete enzymes to protect their plant hosts from certain bacteria.",
    "demetrius.Mushrooms.Winter.03": "Mycorrhiza help provide their plants with trace minerals and other nutrients, and in return the plants provide energy.#$b#Plants might send ten to twenty percent of the energy they produce to their mushroom friends.",
    "demetrius.Mushrooms.Winter.04": "Mushrooms usually reproduces by sending out spores. These spores can remain dormant for years, waiting for the right conditions.",
    "demetrius.Mushrooms.Winter.05": "Fungi are as important to ecosystem as plants and animals are, @.#$b#If we don't take good care of the plant we have, who will?$s",
    "demetrius.Mushrooms.Winter.06": "We have evidence of mycorrhiza forming symbiotic relationships with plants as early as 400 million years ago!#$b#I can't even begin to comprehend timescales like that, @.",
    "demetrius.Mushrooms.Winter.07": "Multiple lineages of fungi seem capable of forming mycorrhiza, so this appears to have evolved multiple times.#$b#It must be important, if evolution keeps trying this.",
    "demetrius.Mushrooms.Winter.08": "About three quarters of all plant species form mycorrhiza with at least some species of fungi. Some orchids are even completely dependent and would die without their fungus friends.$h",
    "demetrius.Mushrooms.Winter.09": "Mycorrhiza also help transfer nutrients and energy between plants when they need it.#$b#Mature trees, for example, sometimes give sugar to smaller saplings nearby through the mycorrhiza.",
    "demetrius.Mushrooms.Winter.10": "Gotta write my end-of-year report soon.#$b#I keep complaining that grants are the worst part of my job, but no, this end-of-year report is the worst part of my job.$s",

    // Misc CT dialogue, for 1.6
    "dialogue.firstvisit.islandSouth": "You went to Ginger Island? Come, tell me about all the flora and fauna you saw!$h",

    "dialogue.fishcaught.sturgeon": "You caught a sturgeon, you say? Those fish are gigantic! How did you manage?",
    "dialogue.fishcaught.goby": "You caught a goby? That fish is quite rare.#$b#Say, where did you catch it?",
    "dialogue.fishcaught.carp": "My father used to bring me fishing when I was a child. I was never any good at it, though.",
    "dialogue.fishcaught.eel": "Hey, @, did you know that electric eel not only can shock you, they can also sense the electric fields generated by other fish?#$y '_Yes_Oh, I won't bother you then._No_Isn't it fun to learn new things?'",
    "dialogue.fishcaught.octopus": "You know, @, octopodes are some of the smartest animals in the sea.#$b#Imagine if they lived as long as we do...",
    "dialogue.fishcaught.squid": "Vampire squid are actually more closely related to octopodes.#$b#Sorry. I had to get that off my chest.$h",

    "demetrius.farmcave.fourweeks.Mushrooms": "You know, @, I've been wondering if I should start trying to cultivate some mushrooms indoors myself someday...",
    "demetrius.farmcave.fourweeks.Bats": "Sometimes I wonder if it'd be wise to eat the fruit those bats bring...",

    "demetrius.farmcave.eightweeks.Mushrooms": "I started growing some mushrooms in the basement. Forgot to tell Robin.#$b#She walked into them in the night. Wasn't very happy with me.",
    "demetrius.farmcave.eightweeks.Bats": "How do those bats get fruit that's out of season, I wonder?",

    "demetrius.farmcave.oneyear": "You know, @, I've never properly thanked you for letting me set up my little experiment in your cave.#$b#I've gotten a lot of data from it, it's been really useful.#$e#So thank you. Very much. From the bottom of my heart.#$e#I'm serious. Thank you.#$e#I can thank you some more if you really want more but I need to get back to work.",

    "demetrius.robin.axe": "Hey, thanks for bringing my wife her axe back. I haven't seen her so happy in weeks!$h"
}