{
    /*********
    * Mail
    **********/

    "CircusMail.Title": "The Greatest Show On Earth",
    "CircusMail.Text": "Two weeks only, the Cirque de La Lune's in town! Featuring death-defying acrobatics, ferocious tamed lions, mind-bending magic shows, and, of course, clowns! Visit us in Zuzu City while we're here!",

    "Aquarium.Title": "Zuzu City Aquarium Presents: Denizens of the Deep!",
    "Aquarium.Text": "Ever interested in the crazy weird creatures that inhabit the depths of the ocean! Now you have an opportunity to meet them! For two weeks only, our Denizens of the Deep exhibit will let you see anglerfish, rattails, and even vampire squid!",

    // anyone else remember Medieval Times? 
    "Castle.Title": "Jousting, Knights, and Festivities!",
    "Castle.Description": "Come see an unique attraction in Castle Village! Featuring dynamic jousts, expert horsemanship, and a feast fit for kings! Only 1000$ per person!",

    // Joja mail
    "JojaMail.Summer.Title": "It's Summer!",
    "JojaMail.Summer.Text.1": "Summer's the best, isn't it? Pools, ice cream, and, best of all, NO SCHOOL. Come to Joja for our Galatic Ice Cream (limited edition!), freezy pops, and edible pool noodles!",

    "JojaMail.Fall.Title": "Back to School!",
    "JojaMail.Fall.Text.1": "Get all the school supplies your child needs cheap from Joja! Loose leaf paper, binders, and new spirals all around!",

    "JojaMail.Winter.Title": "Hot Chocolate For All!",
    "JojaMail.Winter.Text.1": "Come in to your local JojaMart, get a free cup of hot cocoa on us!",
    "JojaMail.Winter.Text.2": "Required minimum 2000$ purchase to qualify for free hot cocoa.",

    // Medications, because WTF America
    "SkinImplants.Title": "Fix Your Jawline!",
    "SkinImplants.Text.1": "Ever thought your jawline needed a little work? Well, come by Doctor Hendricks today for our patented jawline injection! This is the only outpatient procedure guaranteed to firm up those jowls and sharpen that jawline. 30% off for the next two weeks!",
    "SkinImplants.Text.2": "There is a small risk the needle may puncture a vein, which may lead to numbness, blindness, or even death.",

    // vacation
    "IslandVacation.Title": "Take off to a Tropical Paradise",
    "IslandVacation.Text.1": "Enjoy a nice pina colada on the white sandy beaches of Ginger Island! Just 1000$ for a ticket!",
    "IslandVacation.Text.2": "Departs daily from the Pelican Town Beach.",

    /*********
    * Dialogue
    *********/
}