{"Changes":[
    // Emily is the older, more responsible sibling (if a bit New Age about it.)
    // Emily should get additional special lines when the player's luck is high.

    // Todo: lines about parrot?

    // paternal grandparents are from Pelican Town, but neither sister was born here.
    // Father is a traveling salesperson (possibly equipment for hospitals?). Mother was a lawyer. High-powered, money-making, always-traveling parents.
    {
        "LogName": "Emily - base dialogue",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Emily",
        "Entries":{
            "1{{YearRemainder}}": "Mom and Dad sent us another letter the other day. I wonder how they've been?$s"
        }
    },
    {
        "LogName": "Emily - parrot",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Emily",
        "When": {"HasSeenEvent": 463391}, // parrot event.
        "Entries": {
            "27{{YearRemainder}}": "Oh, @, I had a great time singing with my parrot friend the other day! I think he's healing well.$h",
        }
    },
    {
        "LogName": "Emily mid-hearts, Y1",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Emily",
        "Entries": {
            "Resort_Dance_2": "@, come dance with me!$h",

            "Mon8": "@, I think there's something very special about you.",
            
            "2{{YearRemainder}}": "Made some overnight oats the other day, with fresh strawberries!$h",
            "4{{YearRemainder}}": "Ugh, I think our sink is leaking. Gotta go find a plumber, I guess.$s",
            "6{{YearRemainder}}": "@! Look at this new yarn my mother sent me! Isn't it so soft?$h",
            "11{{YearRemainder}}": "I love taking walks, whenever I have the time to do so.$h#$b#One of the best parts of living here.$h",
            "13{{YearRemainder}}": "I'm hoping at some point to move away and see if I can make it as a fashion designer.",
            "17{{YearRemainder}}": "Have I considered moving out of town? Of course I have, but Pelican Town is my home.",
            "18{{YearRemainder}}": "Started working on a new dress! I'm thinking cute little cap sleeves and a full circle skirt...$h",
            "19{{YearRemainder}}": "Sometimes when the Saloon isn't busy Gus lets me rest my feet and knit for a while.#$b#Did you know that Joja cashiers aren't allowed to sit down? I can't imagine how much their feet must hurt.",
            "25{{YearRemainder}}": "The month is almost over. Say, @, what are you planning for next month?"
        },
        "When": {"YearModulus": "1"}
    },
    {
        "LogName": "Emily mid-hearts, Y1 high luck",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Emily",
        "Entries": {
            "8{{YearRemainder}}": "@, I sense good things happening to you today.",
            "10{{YearRemainder}}": "@, I think luck will be on your side today!",

            "winter_Sun4": "I sense a good aura around you today, @.$h#$b#Something about you is especially....wonderful...today.$h",
        },
        "When": {
            "YearModulus": "1",
            "Query: {{DailyLuck}} > 0.05": true
        }
    },
    {
        "LogName": "Emily mid-hearts, Y2",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Emily",
        "Entries": {
            "2_2": "I believe that if you're kind to nature, nature will be kind to you in turn.",
            "3_2": "Haley has always been the baby of the family.#$b#She's only a few years younger than I am, but our parents definitely spoiled her more.#$e#Sometimes I worry.",
            "5_2": "I like doing flatfelled seams, even if they're a lot of work. They're so much more durable!$h",
            "7_2": "We used to love visiting castles with our parents.$s",
            "8_2": "I've considered moving away from Pelican Town, yes.#$e#No, don't get me wrong, I love it here, but our local employment options can be...lacking.$s#$e#If I want a future that's not just being a barmaid I may need to leave.#$b#I really don't want to, though.",
            "9_2": "Pelican Town is so beautiful. I wish I could spend more time exploring the forest.$s#$b#I've got work all the time though.",
            "11_2": "Gus wakes up at the crack of dawn to make bread for the Saloon. Honestly, I'm not quite sure when he sleeps...#$b#Probably the hardest working man in all of this town. And the best boss I could ask for.$h",
            "12_2": "My father was originally from Pelican Town, but he moved away for college.#$e#We moved back when I was around five or so? Mom and Dad wanted a safer, quieter place to raise kids.",
            "13_2": "Dad was a traveling salesman. Always gone on a trip to some location or another.#$e#Mom had to travel a lot for her law practice too.",

            "Tue10": "I've made most of my clothing, I love to sew.$h#$b#Plus, you get better clothing if you make it yourself.",

            "Sun6": "Our parents? I'm not quite sure where they're traveling these days...$s",
            "summer_Sun": "@, what have you been up to?$h",
            "summer_Sat6": "@, you've ever just taken a day for yourself? The lovely weather these days makes me really want to!",
        },
        "When": {"YearModulus": "2"}
    },
    {
        "LogName": "Emily mid-hearts, Y3",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Emily",
        "Entries": {
            "7_2": "I've been doing a lot of lace insertion work lately. It's so pretty but so tedious.",
            "8_2": "@, do you think I could sell the clothing I make?",
            "9_2": "Made a lovely pizza with a cauliflower base the other day. Haley hated it though.",
            "11_2": "Gus gave me some spaghetti to take home the other day.$h#$b#To be honest, @, if Gus didn't give Haley and me food I'm not sure what we'd be eating most nights.$s",
            "13_2": "Started knitting a new set of socks the other day. Socks are so fast and easy to knit, and most people like them as presents.#$b#Except Haley.",
            "14_2": "Gus gave us some day-old bread the other day and we made sandwiches with pickled daikon and falafel. Haley loved it too!$h",
            "15_2": "I made some {{i18n: dishes.adult.{{Random: 03, 04, 05, 06, 07, 08, 09, 01, 02}} }} the other day. It was delicious!$h",
            "16_2": "Ugh, I wish Haley would do her share of the chores without me having to remind her all the time.$s",
        },
        "When": {"YearModulus": "3"}
    },
]}